; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph0 - mode
	spectrograph1 - mode
	spectrograph2 - mode
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation9 - direction
	GroundStation7 - direction
	GroundStation6 - direction
	Star0 - direction
	Star8 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 Star8)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star0)
	(supports instrument2 spectrograph0)
	(supports instrument2 spectrograph2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
)
(:goal (and
	(have_image Phenomenon10 spectrograph0)
	(have_image Star11 spectrograph2)
	(have_image Planet12 spectrograph2)
	(have_image Planet13 spectrograph0)
	(have_image Planet14 spectrograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite0 phenomenon10 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon10)
   goals met: 0 of 5
3. (turn_to satellite0 star8 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star8)
   goals met: 0 of 5
4. (calibrate satellite0 instrument0 star8)
   added: (calibrated instrument0)
   goals met: 0 of 5
5. (turn_to satellite0 phenomenon10 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon10)
   goals met: 0 of 5
6. (take_image satellite0 phenomenon10 instrument0 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 1 of 5
7. (turn_to satellite0 planet12 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet12)
   goals met: 1 of 5
8. (take_image satellite0 planet12 instrument0 spectrograph2)
   added: (have_image planet12 spectrograph2)
   goals met: 2 of 5
9. (turn_to satellite0 planet13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet13)
   goals met: 2 of 5
10. (take_image satellite0 planet13 instrument0 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 3 of 5
11. (turn_to satellite0 planet14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet14)
   goals met: 3 of 5
12. (take_image satellite0 planet14 instrument0 spectrograph0)
   added: (have_image planet14 spectrograph0)
   goals met: 4 of 5
13. (turn_to satellite0 star11 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star11)
   goals met: 4 of 5
14. (take_image satellite0 star11 instrument0 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 5 of 5
